
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 26 to add, 9 to change, 17 to destroy.</code></pre>

* Create
  * azurerm_data_protection_backup_instance_blob_storage.finalsabackup
  * azurerm_data_protection_backup_instance_blob_storage.ingestsabackup
  * azurerm_data_protection_backup_instance_blob_storage.sabackup
  * azurerm_data_protection_backup_policy_blob_storage.pre_backup_policy_storage
  * azurerm_data_protection_backup_vault.pre_backup_vault
  * azurerm_resource_group.rg_backup
  * azurerm_role_assignment.backup_role_finalsa
  * azurerm_role_assignment.backup_role_ingestsa
  * azurerm_role_assignment.backup_role_sa
  * azurerm_role_assignment.powerapp_appreg_final
  * azurerm_role_assignment.powerapp_appreg_finalbackup
  * azurerm_role_assignment.powerapp_appreg_ingest
  * azurerm_role_assignment.powerapp_appreg_ingestfinal
  * azurerm_role_assignment.powerapp_appreg_sa
  * azurerm_role_assignment.powerapp_appreg_sabackup
  * module.finalsa_storage_account.azurerm_role_assignment.storage-account-role-assignment[&#34;Storage Blob Data Contributor&#34;]
  * module.finalsa_storage_account_backup.azurerm_storage_account.storage_account
  * module.finalsa_storage_account_backup.random_string.storage_account_random_string
  * module.ingestsa_storage_account_backup.azurerm_storage_account.storage_account
  * module.ingestsa_storage_account_backup.random_string.storage_account_random_string
  * module.sa_storage_account_backup.azurerm_storage_account.storage_account
  * module.sa_storage_account_backup.random_string.storage_account_random_string
* Update
  * azurerm_key_vault_access_policy.dts_pre_access
  * azurerm_key_vault_secret.finalsa_storage_account_connection_string
  * azurerm_media_services_account.ams
  * azurerm_monitor_diagnostic_setting.storageblobingestsa
  * azurerm_monitor_diagnostic_setting.storageblobsa
  * module.ingestsa_storage_account.azurerm_storage_account.storage_account
  * module.key-vault.azurerm_key_vault.kv
  * module.key-vault.azurerm_monitor_diagnostic_setting.kv-ds
  * module.sa_storage_account.azurerm_storage_account.storage_account
* Delete
  * azapi_update_resource.ams_auth
  * azurerm_key_vault_access_policy.appreg_access
  * azurerm_key_vault_access_policy.devops_access
  * azurerm_key_vault_access_policy.dts_cft_developers_access
  * azurerm_key_vault_secret.POSTGRES_PASS
  * azurerm_key_vault_secret.POSTGRES_USER
  * azurerm_private_endpoint.finalsa
  * azurerm_private_endpoint.ingestsa
  * azurerm_private_endpoint.sa
  * azurerm_role_assignment.mi_storage_1
  * azurerm_role_assignment.mi_storage_2
  * azurerm_role_assignment.pre_BlobContributor_mi
  * null_resource.amsid
* Replace
  * azurerm_monitor_diagnostic_setting.ams_1
  * azurerm_monitor_diagnostic_setting.storageblobfinalsa
  * module.data_store_db_v14.null_resource.set-user-permissions-additionaldbs[&#34;pre-pdb-stg&#34;]
  * module.finalsa_storage_account.azurerm_storage_account.storage_account


<details><summary>Change Result (Click me)</summary>

```hcl

  # data.azurerm_key_vault.keyvault will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault" "keyvault" {
      + access_policy                   = (known after apply)
      + enable_rbac_authorization       = (known after apply)
      + enabled_for_deployment          = (known after apply)
      + enabled_for_disk_encryption     = (known after apply)
      + enabled_for_template_deployment = (known after apply)
      + id                              = (known after apply)
      + location                        = (known after apply)
      + name                            = "pre-stg"
      + network_acls                    = (known after apply)
      + public_network_access_enabled   = (known after apply)
      + purge_protection_enabled        = (known after apply)
      + resource_group_name             = "pre-stg"
      + sku_name                        = (known after apply)
      + tags                            = (known after apply)
      + tenant_id                       = (known after apply)
      + vault_uri                       = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # azapi_update_resource.ams_auth will be destroyed
  # (because azapi_update_resource.ams_auth is not in configuration)
  - resource "azapi_update_resource" "ams_auth" {
      - body                    = jsonencode(
            {
              - properties = {
                  - storageAccounts       = [
                      - {
                          - id       = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Storage/storageAccounts/prefinalsastg"
                          - identity = {
                              - useSystemAssignedIdentity = false
                              - userAssignedIdentity      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourcegroups/managed-identities-stg-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/pre-stg-mi"
                            }
                          - type     = "Secondary"
                        },
                      - {
                          - id       = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Storage/storageAccounts/preingestsastg"
                          - identity = {
                              - useSystemAssignedIdentity = false
                              - userAssignedIdentity      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourcegroups/managed-identities-stg-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/pre-stg-mi"
                            }
                          - type     = "Primary"
                        },
                    ]
                  - storageAuthentication = "ManagedIdentity"
                }
            }
        ) -> null
      - id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Media/mediaservices/preamsstg" -> null
      - ignore_casing           = false -> null
      - ignore_missing_property = true -> null
      - name                    = "preamsstg" -> null
      - output                  = jsonencode({}) -> null
      - parent_id               = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg" -> null
      - resource_id             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Media/mediaservices/preamsstg" -> null
      - type                    = "Microsoft.Media/mediaservices@2021-11-01" -> null
    }

  # azurerm_data_protection_backup_instance_blob_storage.finalsabackup will be created
  + resource "azurerm_data_protection_backup_instance_blob_storage" "finalsabackup" {
      + backup_policy_id   = (known after apply)
      + id                 = (known after apply)
      + location           = "uksouth"
      + name               = "pre-finalsa-backup-stg"
      + storage_account_id = (known after apply)
      + vault_id           = (known after apply)
    }

  # azurerm_data_protection_backup_instance_blob_storage.ingestsabackup will be created
  + resource "azurerm_data_protection_backup_instance_blob_storage" "ingestsabackup" {
      + backup_policy_id   = (known after apply)
      + id                 = (known after apply)
      + location           = "uksouth"
      + name               = "pre-ingestsa-backup-stg"
      + storage_account_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Storage/storageAccounts/preingestsastg"
      + vault_id           = (known after apply)
    }

  # azurerm_data_protection_backup_instance_blob_storage.sabackup will be created
  + resource "azurerm_data_protection_backup_instance_blob_storage" "sabackup" {
      + backup_policy_id   = (known after apply)
      + id                 = (known after apply)
      + location           = "uksouth"
      + name               = "pre-sa-backup-stg"
      + storage_account_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Storage/storageAccounts/presastg"
      + vault_id           = (known after apply)
    }

  # azurerm_data_protection_backup_policy_blob_storage.pre_backup_policy_storage will be created
  + resource "azurerm_data_protection_backup_policy_blob_storage" "pre_backup_policy_storage" {
      + id                 = (known after apply)
      + name               = "pre-backup-policy-stg"
      + retention_duration = "P1D"
      + vault_id           = (known after apply)
    }

  # azurerm_data_protection_backup_vault.pre_backup_vault will be created
  + resource "azurerm_data_protection_backup_vault" "pre_backup_vault" {
      + datastore_type      = "VaultStore"
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "pre-backup-vault-stg"
      + redundancy          = "LocallyRedundant"
      + resource_group_name = "pre-stg"
      + tags                = {
          + "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          + "application"         = "pre-recorded-evidence"
          + "businessArea"        = "Cross-Cutting"
          + "changeUrl"           = ""
          + "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
          + "environment"         = "staging"
          + "managedBy"           = "Pre Recorded Evidence"
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }
    }

  # azurerm_key_vault_access_policy.appreg_access will be destroyed
  # (because azurerm_key_vault_access_policy.appreg_access is not in configuration)
  - resource "azurerm_key_vault_access_policy" "appreg_access" {
      - certificate_permissions = [] -> null
      - id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg/objectId/1043d250-96eb-4cc3-af11-3215cfbf028f" -> null
      - key_permissions         = [] -> null
      - key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg" -> null
      - object_id               = "1043d250-96eb-4cc3-af11-3215cfbf028f" -> null
      - secret_permissions      = [
          - "List",
          - "Get",
        ] -> null
      - storage_permissions     = [] -> null
      - tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
    }

  # azurerm_key_vault_access_policy.devops_access will be destroyed
  # (because azurerm_key_vault_access_policy.devops_access is not in configuration)
  - resource "azurerm_key_vault_access_policy" "devops_access" {
      - certificate_permissions = [
          - "List",
          - "Update",
          - "Create",
          - "Import",
          - "Delete",
          - "ManageContacts",
          - "ManageIssuers",
          - "GetIssuers",
          - "ListIssuers",
          - "SetIssuers",
          - "DeleteIssuers",
        ] -> null
      - id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg/objectId/a0c6507c-299c-4f46-96c6-8275d2c45242" -> null
      - key_permissions         = [
          - "List",
          - "Update",
          - "Create",
          - "Import",
          - "Delete",
          - "Get",
        ] -> null
      - key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg" -> null
      - object_id               = "a0c6507c-299c-4f46-96c6-8275d2c45242" -> null
      - secret_permissions      = [
          - "List",
          - "Set",
          - "Delete",
          - "Get",
        ] -> null
      - storage_permissions     = [
          - "List",
          - "Set",
          - "Delete",
          - "Get",
        ] -> null
      - tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
    }

  # azurerm_key_vault_access_policy.dts_cft_developers_access will be destroyed
  # (because azurerm_key_vault_access_policy.dts_cft_developers_access is not in configuration)
  - resource "azurerm_key_vault_access_policy" "dts_cft_developers_access" {
      - certificate_permissions = [
          - "Get",
          - "List",
        ] -> null
      - id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg/objectId/b2a1773c-a5ae-48b5-b5fa-95b0e05eee05" -> null
      - key_permissions         = [
          - "Get",
          - "List",
        ] -> null
      - key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg" -> null
      - object_id               = "b2a1773c-a5ae-48b5-b5fa-95b0e05eee05" -> null
      - secret_permissions      = [
          - "Get",
          - "List",
        ] -> null
      - storage_permissions     = [] -> null
      - tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
    }

  # azurerm_key_vault_access_policy.dts_pre_access will be updated in-place
  ~ resource "azurerm_key_vault_access_policy" "dts_pre_access" {
      ~ certificate_permissions = [
            "List",
          - "Update",
          - "Create",
          - "Import",
          - "Delete",
          - "ManageContacts",
          - "ManageIssuers",
          + "Get",
            "GetIssuers",
            "ListIssuers",
          - "SetIssuers",
          - "DeleteIssuers",
          - "Recover",
        ]
        id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg/objectId/b1fd4154-355f-4683-a795-d09cdb814d16"
      ~ key_permissions         = [
            "List",
          - "Update",
          - "Create",
          - "Import",
          - "Delete",
          - "Recover",
          + "Get",
        ]
      ~ secret_permissions      = [
            "List",
          - "Set",
          - "Delete",
          - "Recover",
          + "Get",
        ]
      ~ storage_permissions     = [
          + "List",
          + "Get",
        ]
        # (3 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.POSTGRES_PASS will be destroyed
  # (because azurerm_key_vault_secret.POSTGRES_PASS is not in configuration)
  - resource "azurerm_key_vault_secret" "POSTGRES_PASS" {
      - content_type            = "" -> null
      - id                      = "https://pre-stg.vault.azure.net/secrets/postgresdb-password/47a45f0cfbce46d7915ae6165e56a837" -> null
      - key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg" -> null
      - name                    = "postgresdb-password" -> null
      - resource_id             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg/secrets/postgresdb-password/versions/47a45f0cfbce46d7915ae6165e56a837" -> null
      - resource_versionless_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg/secrets/postgresdb-password" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value)
      - version                 = "47a45f0cfbce46d7915ae6165e56a837" -> null
      - versionless_id          = "https://pre-stg.vault.azure.net/secrets/postgresdb-password" -> null
    }

  # azurerm_key_vault_secret.POSTGRES_USER will be destroyed
  # (because azurerm_key_vault_secret.POSTGRES_USER is not in configuration)
  - resource "azurerm_key_vault_secret" "POSTGRES_USER" {
      - id                      = "https://pre-stg.vault.azure.net/secrets/postgresdb-username/3b8ba020342b4e9abce5ea785b00496a" -> null
      - key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg" -> null
      - name                    = "postgresdb-username" -> null
      - resource_id             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg/secrets/postgresdb-username/versions/3b8ba020342b4e9abce5ea785b00496a" -> null
      - resource_versionless_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg/secrets/postgresdb-username" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value)
      - version                 = "3b8ba020342b4e9abce5ea785b00496a" -> null
      - versionless_id          = "https://pre-stg.vault.azure.net/secrets/postgresdb-username" -> null
    }

  # azurerm_key_vault_secret.finalsa_storage_account_connection_string will be updated in-place
  ~ resource "azurerm_key_vault_secret" "finalsa_storage_account_connection_string" {
        id                      = "https://pre-stg.vault.azure.net/secrets/finalsa-storage-account-connection-string/52d05b6b8ba34b4e83a5122ccbe1b51b"
        name                    = "finalsa-storage-account-connection-string"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (6 unchanged attributes hidden)
    }

  # azurerm_media_services_account.ams will be updated in-place
  ~ resource "azurerm_media_services_account" "ams" {
        id                          = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Media/mediaServices/preamsstg"
        name                        = "preamsstg"
        tags                        = {
            "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
            "application"         = "pre-recorded-evidence"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
            "environment"         = "staging"
            "managedBy"           = "Pre Recorded Evidence"
        }
        # (3 unchanged attributes hidden)

      ~ identity {
          ~ type         = "SystemAssigned, UserAssigned" -> "UserAssigned"
            # (3 unchanged attributes hidden)
        }

      - storage_account {
          - id         = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Storage/storageAccounts/prefinalsastg" -> null
          - is_primary = false -> null
        }
      + storage_account {
          + id         = (known after apply)
          + is_primary = false
        }

        # (2 unchanged blocks hidden)
    }

  # azurerm_monitor_diagnostic_setting.ams_1 must be replaced
-/+ resource "azurerm_monitor_diagnostic_setting" "ams_1" {
      ~ id                         = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Media/mediaservices/preamsstg|preamsstg" -> (known after apply)
        name                       = "preamsstg"
      ~ target_resource_id         = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Media/mediaservices/preamsstg" -> "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Media/mediaServices/preamsstg" # forces replacement
        # (1 unchanged attribute hidden)

      - log {
          - category = "KeyDeliveryRequests" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      + log {
          + category = "KeyDeliveryRequests"
          + enabled  = true
        }

        # (2 unchanged blocks hidden)
    }

  # azurerm_monitor_diagnostic_setting.storageblobfinalsa must be replaced
-/+ resource "azurerm_monitor_diagnostic_setting" "storageblobfinalsa" {
      ~ id                         = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Storage/storageAccounts/prefinalsastg/blobServices/default|prefinalsastg" -> (known after apply)
        name                       = "prefinalsastg"
      ~ target_resource_id         = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Storage/storageAccounts/prefinalsastg/blobServices/default" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)

      - log {
          - category = "StorageDelete" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + log {
          + category = "StorageDelete"
          + enabled  = true

          + retention_policy {
              + enabled = true
            }
        }
      - log {
          - category = "StorageRead" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + log {
          + category = "StorageRead"
          + enabled  = true

          + retention_policy {
              + enabled = true
            }
        }
      - log {
          - category = "StorageWrite" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + log {
          + category = "StorageWrite"
          + enabled  = true

          + retention_policy {
              + enabled = true
            }
        }

      - metric {
          - category = "Capacity" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - metric {
          - category = "Transaction" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + metric {
          + category = "Transaction"
          + enabled  = true

          + retention_policy {
              + enabled = true
            }
        }
    }

  # azurerm_monitor_diagnostic_setting.storageblobingestsa will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "storageblobingestsa" {
        id                         = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-s

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

tion_policy_days = (known after apply)
              + version               = (known after apply)
            }
        }

      + routing {
          + choice                      = (known after apply)
          + publish_internet_endpoints  = (known after apply)
          + publish_microsoft_endpoints = (known after apply)
        }

      + share_properties {
          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + retention_policy {
              + days = (known after apply)
            }

          + smb {
              + authentication_types            = (known after apply)
              + channel_encryption_type         = (known after apply)
              + kerberos_ticket_encryption_type = (known after apply)
              + multichannel_enabled            = (known after apply)
              + versions                        = (known after apply)
            }
        }
    }

  # module.ingestsa_storage_account_backup.random_string.storage_account_random_string will be created
  + resource "random_string" "storage_account_random_string" {
      + id          = (known after apply)
      + length      = 24
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.key-vault.azurerm_key_vault.kv will be updated in-place
  ~ resource "azurerm_key_vault" "kv" {
        id                              = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg"
        name                            = "pre-stg"
        tags                            = {
            "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
            "application"         = "pre-recorded-evidence"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
            "environment"         = "staging"
            "managedBy"           = "Pre Recorded Evidence"
        }
        # (13 unchanged attributes hidden)

      ~ network_acls {
          ~ default_action             = "Deny" -> "Allow"
          ~ ip_rules                   = [
              - "20.50.109.148/32",
              - "31.104.4.58/32",
              - "31.126.2.67/32",
              - "80.44.26.160/32",
              - "82.25.53.23/32",
              - "82.9.48.2/32",
              - "86.179.180.2/32",
              - "86.191.141.202/32",
            ]
            # (2 unchanged attributes hidden)
        }
    }

  # module.key-vault.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                         = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg|pre-stg"
        name                       = "pre-stg"
        # (2 unchanged attributes hidden)

      - log {
          - category = "AuditEvent" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 14 -> null
              - enabled = true -> null
            }
        }
      + log {
          + category = "AuditEvent"
          + enabled  = true

          + retention_policy {
              + days    = 14
              + enabled = true
            }
        }
      - log {
          - category = "AzurePolicyEvaluationDetails" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
    }

  # module.sa_storage_account.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Storage/storageAccounts/presastg"
        name                              = "presastg"
      ~ tags                              = {
          - "Deployment Environment" = "stg" -> null
          - "Destroy Me"             = "No" -> null
          - "Team Contact"           = "#Cloud-Native" -> null
            # (7 unchanged elements hidden)
        }
        # (38 unchanged attributes hidden)

      ~ blob_properties {
          ~ change_feed_enabled           = false -> true
            # (3 unchanged attributes hidden)

            # (2 unchanged blocks hidden)
        }

      ~ network_rules {
          ~ ip_rules                   = [
              + "104.44.89.224/27",
              + "13.104.129.128/26",
              + "13.104.145.160/27",
              + "13.104.146.64/26",
              + "13.104.159.0/25",
              + "13.87.0.0/18",
              + "13.87.64.0/19",
              + "13.87.96.0/20",
              + "172.165.0.0/16",
              + "172.166.0.0/15",
              + "172.187.128.0/17",
              + "20.0.0.0/16",
              + "20.108.0.0/16",
              - "20.108.81.107/30",
              + "20.117.128.0/17",
              + "20.117.64.0/18",
              + "20.135.176.0/22",
              + "20.135.180.0/23",
              + "20.150.18.0/25",
              + "20.150.27.0/24",
              + "20.150.40.0/25",
              + "20.150.41.0/24",
              + "20.150.69.0/24",
              + "20.157.107.0/24",
              + "20.157.112.0/24",
              + "20.157.120.0/24",
              + "20.157.157.0/24",
              + "20.157.182.0/24",
              + "20.157.246.0/24",
              + "20.157.28.0/24",
              + "20.162.128.0/17",
              + "20.190.143.0/25",
              + "20.190.169.0/24",
              + "20.190.172.0/24",
              + "20.202.4.0/24",
              + "20.209.30.0/23",
              + "20.209.6.0/23",
              + "20.209.88.0/23",
              + "20.254.0.0/17",
              + "20.26.0.0/16",
              + "20.38.106.0/23",
              + "20.39.208.0/20",
              + "20.39.224.0/21",
              + "20.47.11.0/24",
              + "20.47.114.0/24",
              + "20.47.34.0/24",
              + "20.47.68.0/24",
              + "20.49.128.0/17",
              - "20.49.145.249/30",
              - "20.49.166.118/30",
              - "20.49.166.129/30",
              - "20.49.166.40/30",
              - "20.49.244.238/30",
              + "20.50.96.0/19",
              + "20.58.0.0/18",
              - "20.58.70.192/27",
              - "20.58.70.224/28",
              + "20.60.166.0/23",
              + "20.60.17.0/24",
              + "20.68.0.0/18",
              + "20.68.128.0/17",
              + "20.77.0.0/17",
              + "20.77.128.0/18",
              - "20.90.124.134",
              - "20.90.125.211",
              + "20.90.128.0/17",
              - "20.90.129.0/27",
              - "20.90.129.32/28",
              - "20.90.131.0/26",
              - "20.90.131.120/29",
              - "20.90.131.64/27",
              - "20.90.169.112/30",
              + "20.90.64.0/18",
              + "20.95.67.0/24",
              + "20.95.74.0/23",
              + "20.95.82.0/23",
              + "20.95.84.0/24",
              + "4.158.0.0/15",
              + "4.234.0.0/16",
              + "4.250.0.0/16",
              + "40.120.136.0/22",
              + "40.120.32.0/19",
              + "40.126.15.0/25",
              + "40.126.41.0/24",
              + "40.126.44.0/24",
              + "40.64.144.0/24",
              + "40.79.201.0/24",
              + "40.79.215.0/24",
              + "40.80.0.0/22",
              + "40.80.12.0/22",
              + "40.81.128.0/19",
              + "40.81.160.0/20",
              + "40.90.128.112/28",
              + "40.90.128.160/28",
              + "40.90.130.128/28",
              + "40.90.131.64/27",
              + "40.90.139.64/27",
              + "40.90.141.192/26",
              + "40.90.143.64/27",
              + "40.90.150.96/27",
              + "40.90.153.64/27",
              + "40.90.154.0/26",
              + "40.90.17.160/27",
              + "40.90.17.32/27",
              + "40.90.29.192/26",
              + "40.93.67.0/24",
              + "51.104.0.0/19",
              + "51.104.192.0/18",
              - "51.104.248.11/30",
              - "51.104.30.172/30",
              - "51.104.30.192/26",
              - "51.104.31.0/27",
              - "51.104.31.32/28",
              - "51.104.31.48/29",
              - "51.104.31.64/26",
              + "51.105.0.0/18",
              + "51.105.64.0/20",
              - "51.105.77.96/27",
              + "51.11.0.0/18",
              + "51.11.128.0/18",
              - "51.11.172.160/30",
              - "51.11.172.30/30",
              - "51.11.172.56/30",
              - "51.11.24.198/30",
              - "51.11.25.172/30",
              - "51.11.25.68/30",
              + "51.132.0.0/18",
              + "51.132.128.0/17",
              - "51.132.161.225/30",
              - "51.132.215.162/30",
              - "51.132.215.182/30",
              + "51.140.0.0/17",
              + "51.140.128.0/18",
              - "51.140.148.0/28",
              - "51.140.211.0/28",
              - "51.140.212.224/27",
              - "51.140.245.29",
              - "51.140.61.124",
              - "51.140.77.227",
              - "51.140.80.51",
              - "51.141.124.13",
              + "51.141.128.32/27",
              + "51.141.129.192/26",
              + "51.141.129.64/26",
              + "51.141.130.0/25",
              + "51.141.135.0/24",
              + "51.141.156.0/22",
              + "51.141.192.0/18",
              - "51.141.47.105",
              + "51.142.192.0/18",
              + "51.142.40.11",
              + "51.142.47.249",
              + "51.142.47.252",
              + "51.142.64.0/18",
              + "51.143.128.0/18",
              + "51.143.192.0/21",
              + "51.143.200.0/28",
              + "51.143.201.0/24",
              + "51.143.208.0/20",
              - "51.143.208.216/29",
              + "51.143.224.0/19",
              + "51.145.0.0/17",
              - "51.145.104.29/30",
              + "52.101.88.0/23",
              + "52.101.95.0/24",
              + "52.101.96.0/23",
              + "52.102.164.0/24",
              + "52.103.165.0/24",
              + "52.103.37.0/24",
              + "52.108.100.0/23",
              + "52.108.138.0/24",
              + "52.108.50.0/23",
              + "52.108.88.0/24",
              + "52.108.99.0/24",
              + "52.109.28.0/22",
              + "52.109.40.0/22",
              + "52.111.242.0/24",
              + "52.112.231.0/24",
              + "52.112.240.0/20",
              + "52.113.128.0/24",
              + "52.113.200.0/22",
              + "52.113.204.0/24",
              + "52.113.224.0/19",
              + "52.114.88.0/22",
              + "52.120.160.0/19",
              + "52.120.240.0/20",
              + "52.123.141.0/24",
              + "52.123.142.0/23",
              + "52.136.18.0/24",
              + "52.136.21.0/24",
              + "52.151.64.0/18",
              + "52.239.187.0/25",
              + "52.239.231.0/24",
              + "52.245.64.0/22",
              + "52.253.162.0/23",
              - "62.31.90.131",
              - "82.12.61.131",
              - "82.21.185.208",
              - "86.179.180.2",
              - "86.24.226.11",
            ]
            # (3 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.sa_storage_account_backup.azurerm_storage_account.storage_account will be created
  + resource "azurerm_storage_account" "storage_account" {
      + access_tier                       = "Hot"
      + account_kind                      = "StorageV2"
      + account_replication_type          = "LRS"
      + account_tier                      = "Standard"
      + allow_nested_items_to_be_public   = false
      + cross_tenant_replication_enabled  = true
      + default_to_oauth_authentication   = false
      + enable_https_traffic_only         = true
      + id                                = (known after apply)
      + infrastructure_encryption_enabled = false
      + is_hns_enabled                    = false
      + large_file_share_enabled          = (known after apply)
      + location                          = "ukwest"
      + min_tls_version                   = "TLS1_2"
      + name                              = "presabackupstg"
      + nfsv3_enabled                     = false
      + primary_access_key                = (sensitive value)
      + primary_blob_connection_string    = (sensitive value)
      + primary_blob_endpoint             = (known after apply)
      + primary_blob_host                 = (known after apply)
      + primary_connection_string         = (sensitive value)
      + primary_dfs_endpoint              = (known after apply)
      + primary_dfs_host                  = (known after apply)
      + primary_file_endpoint             = (known after apply)
      + primary_file_host                 = (known after apply)
      + primary_location                  = (known after apply)
      + primary_queue_endpoint            = (known after apply)
      + primary_queue_host                = (known after apply)
      + primary_table_endpoint            = (known after apply)
      + primary_table_host                = (known after apply)
      + primary_web_endpoint              = (known after apply)
      + primary_web_host                  = (known after apply)
      + public_network_access_enabled     = true
      + queue_encryption_key_type         = "Service"
      + resource_group_name               = "pre-stg-backup"
      + secondary_access_key              = (sensitive value)
      + secondary_blob_connection_string  = (sensitive value)
      + secondary_blob_endpoint           = (known after apply)
      + secondary_blob_host               = (known after apply)
      + secondary_connection_string       = (sensitive value)
      + secondary_dfs_endpoint            = (known after apply)
      + secondary_dfs_host                = (known after apply)
      + secondary_file_endpoint           = (known after apply)
      + secondary_file_host               = (known after apply)
      + secondary_location                = (known after apply)
      + secondary_queue_endpoint          = (known after apply)
      + secondary_queue_host              = (known after apply)
      + secondary_table_endpoint          = (known after apply)
      + secondary_table_host              = (known after apply)
      + secondary_web_endpoint            = (known after apply)
      + secondary_web_host                = (known after apply)
      + sftp_enabled                      = false
      + shared_access_key_enabled         = true
      + table_encryption_key_type         = "Service"
      + tags                              = {
          + "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          + "application"         = "pre-recorded-evidence"
          + "businessArea"        = "Cross-Cutting"
          + "changeUrl"           = ""
          + "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
          + "environment"         = "staging"
          + "managedBy"           = "Pre Recorded Evidence"
        }

      + blob_properties {
          + change_feed_enabled      = false
          + default_service_version  = (known after apply)
          + last_access_time_enabled = false
          + versioning_enabled       = true

          + container_delete_retention_policy {
              + days = 7
            }

          + delete_retention_policy {
              + days = 365
            }
        }

      + immutability_policy {
          + allow_protected_append_writes = true
          + period_since_creation_in_days = 730
          + state                         = "Unlocked"
        }

      + network_rules {
          + bypass                     = [
              + "AzureServices",
            ]
          + default_action             = "Allow"
          + ip_rules                   = (known after apply)
          + virtual_network_subnet_ids = [
              + "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/ss-ptl-network-rg/providers/Microsoft.Network/virtualNetworks/ss-ptl-vnet/subnets/iaas",
            ]
        }

      + queue_properties {
          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + hour_metrics {
              + enabled               = (known after apply)
              + include_apis          = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
            }

          + logging {
              + delete                = (known after apply)
              + read                  = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
              + write                 = (known after apply)
            }

          + minute_metrics {
              + enabled               = (known after apply)
              + include_apis          = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
            }
        }

      + routing {
          + choice                      = (known after apply)
          + publish_internet_endpoints  = (known after apply)
          + publish_microsoft_endpoints = (known after apply)
        }

      + share_properties {
          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + retention_policy {
              + days = (known after apply)
            }

          + smb {
              + authentication_types            = (known after apply)
              + channel_encryption_type         = (known after apply)
              + kerberos_ticket_encryption_type = (known after apply)
              + multichannel_enabled            = (known after apply)
              + versions                        = (known after apply)
            }
        }
    }

  # module.sa_storage_account_backup.random_string.storage_account_random_string will be created
  + resource "random_string" "storage_account_random_string" {
      + id          = (known after apply)
      + length      = 24
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

Plan: 26 to add, 9 to change, 17 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":388,"Program":"tfcmt","SHA1":"","Vars":{}} -->